# AddVertices Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexStreamPosition..::..AddVertices Method
VertexStreamPosition Class See Also
---
Inserts multiple VertexStreamPosition instances into the stream and associated buffer.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void AddVertices(
	IList<VertexPosition> vertices
)
```

Visual Basic
---
```text
Public Sub AddVertices ( _
	vertices As IList(Of VertexPosition) _
)
```

Visual C++
---
```text
public:
void AddVertices(
	IList<VertexPosition^>^ vertices
)
```

# ### Parameters
vertices
    Type: System.Collections.Generic..::..IList<(Of <(<'VertexPosition>)>)> The vertices to be inserted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also
VertexStreamPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace